CSI API ETABS v1
cLinkObj.SetLocalAxes Method
 Assigns a local axis angle to link objects.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetLocalAxes(
	string Name,
	double Ang,
	eItemType ItemType = eItemType.Objects
)
Function SetLocalAxes (
	Name As String,
	Ang As Double,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cLinkObj
Dim Name As String
Dim Ang As Double
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetLocalAxes(Name,
	Ang, ItemType)
int SetLocalAxes(
	String^ Name,
	double Ang,
	eItemType ItemType = eItemType::Objects
)
abstract SetLocalAxes :
        Name : string *
        Ang : float *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
The name of an existing link object or group, depending on the value of the ItemType item.
Ang
Type: System.Double
This is the angle that the local 2 and 3 axes are rotated about the positive local 1 axis, from the default orientation. The rotation for a positive angle appears counter clockwise when the local +1 axis is pointing toward you. [deg].
ItemType (Optional)
Type: ETABSv1.eItemType
This is one of the items in the eItemType enumeration.
If this item is Objects, the assignment is made to the link object specified by the Name item.
If this item is Group, the assignment is made to all link objects in the group specified by the Name item.
If this item is SelectedObjects, the assignment is made to all selected link objects, and the Name item is ignored.
Return Value
Type: Int32
Returns zero if the local axis angle is successfully assigned; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Name As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add link object by points
       ret = SapModel.LinkObj.AddByPoint("1", "5", Name)
   'assign link local axis angle
       ret = SapModel.LinkObj.SetLocalAxes(Name, 30)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cLinkObj Interface
ETABSv1 Namespace